uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/engine_sensor_adc_UABH_B_regs.h
/*!*****************************************************************************
* \file engine_sensor_adc_UABH_B_regs.h
* \version 1.10
*
* \brief 
*   API for Universal Analog Block (UAB)
*
********************************************************************************
* \copyright
* (c) 2014-2016, Cypress Semiconductor Corporation. All rights reserved.
* This software, including source code, documentation and related
* materials ("Software"), is owned by Cypress Semiconductor
* Corporation ("Cypress") and is protected by and subject to worldwide
* patent protection (United States and foreign), United States copyright
* laws and international treaty provisions. Therefore, you may use this
* Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, nonexclusive,
* non-transferable license to copy, modify, and compile the
* Software source code solely for use in connection with Cypress's
* integrated circuit products. Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE. Cypress reserves the right to make
* changes to the Software without notice. Cypress does not assume any
* liability arising out of the application or use of the Software or any
* product or circuit described in the Software. Cypress does not
* authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/
    
#ifndef engine_sensor_adc_UABH_B_REGS_H
#define engine_sensor_adc_UABH_B_REGS_H

#include "cytypes.h"
#include "cyfitter.h"
#include "engine_sensor_adc_UABH_B_CyUAB_regs.h"

/*!
* \addtogroup group_general
* @{
*/

/*! Get right-aligned register field; mask parameter is alredy shifted */
#define engine_sensor_adc_UABH_B_GET_FIELD(addr,mask,shift)         CyUAB_GET_FIELD((addr),(mask),(shift))
/*! Set register field without modifying other fields; mask parameter is already shifted */
#define engine_sensor_adc_UABH_B_SET_FIELD(addr,mask,val,shift)     CyUAB_SET_FIELD((addr),(mask),(val),(shift))
/*! Set multiple register fields with a single register write; mask parameter is already shifted and composite of all fields being written */
#define engine_sensor_adc_UABH_B_SET_VARIOUS_FIELDS(addr,mask,val)  CyUAB_SET_VARIOUS_FIELDS((addr), (mask), (val))

/*! number of array elements */
#define engine_sensor_adc_UABH_B_ELEMENT_COUNT(x)  (sizeof((x))/sizeof((x)[0]))
/*! @} group_general */
    
    
#define engine_sensor_adc_UABH_B_POSITION engine_sensor_adc_UABH_B_halfuab__POSITION

#define engine_sensor_adc_UABH_B_ISODD  ( (engine_sensor_adc_UABH_B_POSITION % 2UL) != 0UL )


#define engine_sensor_adc_UABH_B_BAD_XIN 0xabadc0deUL
	
/* x input terminals to VIN mapping selected by Creator P&R */

/* 
Decision tree below assigns unused x inputs to unused vin 
can't use preprocessor undef (MISRA requirement, so using a separate flag variable for each stage
VIN_FLAGS A-D track assigned vin assignments through the decision tree steps
*/

#define engine_sensor_adc_UABH_B_VIN0_ASSIGNED  ( (\
        (engine_sensor_adc_UABH_B_halfuab__X0==0) || (engine_sensor_adc_UABH_B_halfuab__X1==0) || \
        (engine_sensor_adc_UABH_B_halfuab__X2==0) || (engine_sensor_adc_UABH_B_halfuab__X3==0) ) ? 1 : 0 )
#define engine_sensor_adc_UABH_B_VIN1_ASSIGNED  ( (\
        (engine_sensor_adc_UABH_B_halfuab__X0==1) || (engine_sensor_adc_UABH_B_halfuab__X1==1) || \
        (engine_sensor_adc_UABH_B_halfuab__X2==1) || (engine_sensor_adc_UABH_B_halfuab__X3==1) ) ? 1 : 0 )
#define engine_sensor_adc_UABH_B_VIN2_ASSIGNED  ( (\
        (engine_sensor_adc_UABH_B_halfuab__X0==2) || (engine_sensor_adc_UABH_B_halfuab__X1==2) || \
        (engine_sensor_adc_UABH_B_halfuab__X2==2) || (engine_sensor_adc_UABH_B_halfuab__X3==2) ) ? 1 : 0 )
#define engine_sensor_adc_UABH_B_VIN3_ASSIGNED  ( (\
        (engine_sensor_adc_UABH_B_halfuab__X0==3) || (engine_sensor_adc_UABH_B_halfuab__X1==3) || \
        (engine_sensor_adc_UABH_B_halfuab__X2==3) || (engine_sensor_adc_UABH_B_halfuab__X3==3) ) ? 1 : 0 )


#define engine_sensor_adc_UABH_B__X0_FLAGS  ( \
    ( (engine_sensor_adc_UABH_B_VIN0_ASSIGNED)    ) | \
    ( (engine_sensor_adc_UABH_B_VIN1_ASSIGNED)<<1 ) | \
    ( (engine_sensor_adc_UABH_B_VIN2_ASSIGNED)<<2 ) | \
    ( (engine_sensor_adc_UABH_B_VIN3_ASSIGNED)<<3 )   \
)
    
/*x0 input assignment*/
#if ( (0<=engine_sensor_adc_UABH_B_halfuab__X0) && (engine_sensor_adc_UABH_B_halfuab__X0<=3) )
    /*fitter assignment is valid*/
    #define engine_sensor_adc_UABH_B_X0         (engine_sensor_adc_UABH_B_halfuab__X0)
    #define engine_sensor_adc_UABH_B__X1_FLAGS  (engine_sensor_adc_UABH_B__X0_FLAGS)
#else
    /*x0 input is unused (==-1), so map to unused vin*/
    #if   (( engine_sensor_adc_UABH_B__X0_FLAGS & 0x1 )==0)
        #define engine_sensor_adc_UABH_B_X0 (0)
        #define engine_sensor_adc_UABH_B__X1_FLAGS (engine_sensor_adc_UABH_B__X0_FLAGS|0x1)
    #elif (( engine_sensor_adc_UABH_B__X0_FLAGS & 0x2 )==0)
        #define engine_sensor_adc_UABH_B_X0 (1)
        #define engine_sensor_adc_UABH_B__X1_FLAGS (engine_sensor_adc_UABH_B__X0_FLAGS|0x2)
    #elif (( engine_sensor_adc_UABH_B__X0_FLAGS & 0x4 )==0)
        #define engine_sensor_adc_UABH_B_X0 (2)
        #define engine_sensor_adc_UABH_B__X1_FLAGS (engine_sensor_adc_UABH_B__X0_FLAGS|0x4)
    #elif (( engine_sensor_adc_UABH_B__X0_FLAGS & 0x8 )==0)
        #define engine_sensor_adc_UABH_B_X0 (3)
        #define engine_sensor_adc_UABH_B__X1_FLAGS (engine_sensor_adc_UABH_B__X0_FLAGS|0x8)
    #else
        #error "engine_sensor_adc_UABH_B_X0 mapping is bad"
    #endif
#endif

/*x1 input assignment*/
#if ( (0<=engine_sensor_adc_UABH_B_halfuab__X1) && (engine_sensor_adc_UABH_B_halfuab__X1<=3) )
    /*fitter assignment is valid*/
    #define engine_sensor_adc_UABH_B_X1         (engine_sensor_adc_UABH_B_halfuab__X1)
    #define engine_sensor_adc_UABH_B__X2_FLAGS  (engine_sensor_adc_UABH_B__X1_FLAGS)
#else
    /*x1 input is unused (==-1), so map to unused vin*/
    #if   (( engine_sensor_adc_UABH_B__X1_FLAGS & 0x1 )==0)
        #define engine_sensor_adc_UABH_B_X1 (0)
        #define engine_sensor_adc_UABH_B__X2_FLAGS (engine_sensor_adc_UABH_B__X1_FLAGS|0x1)
    #elif (( engine_sensor_adc_UABH_B__X1_FLAGS & 0x2 )==0)
        #define engine_sensor_adc_UABH_B_X1 (1)
        #define engine_sensor_adc_UABH_B__X2_FLAGS (engine_sensor_adc_UABH_B__X1_FLAGS|0x2)
    #elif (( engine_sensor_adc_UABH_B__X1_FLAGS & 0x4 )==0)
        #define engine_sensor_adc_UABH_B_X1 (2)
        #define engine_sensor_adc_UABH_B__X2_FLAGS (engine_sensor_adc_UABH_B__X1_FLAGS|0x4)
    #elif (( engine_sensor_adc_UABH_B__X1_FLAGS & 0x8 )==0)
        #define engine_sensor_adc_UABH_B_X1 (3)
        #define engine_sensor_adc_UABH_B__X2_FLAGS (engine_sensor_adc_UABH_B__X1_FLAGS|0x8)
    #else
        #error "engine_sensor_adc_UABH_B_X1 mapping is bad"
    #endif
#endif

/*x2 input assignment*/
#if ( (0<=engine_sensor_adc_UABH_B_halfuab__X2) && (engine_sensor_adc_UABH_B_halfuab__X2<=3) )
    /*fitter assignment is valid*/
    #define engine_sensor_adc_UABH_B_X2         (engine_sensor_adc_UABH_B_halfuab__X2)
    #define engine_sensor_adc_UABH_B__X3_FLAGS  (engine_sensor_adc_UABH_B__X2_FLAGS)
#else
    /*x2 input is unused (==-1), so map to unused vin*/
    #if   (( engine_sensor_adc_UABH_B__X2_FLAGS & 0x1 )==0)
        #define engine_sensor_adc_UABH_B_X2 (0)
        #define engine_sensor_adc_UABH_B__X3_FLAGS (engine_sensor_adc_UABH_B__X2_FLAGS|0x1)
    #elif (( engine_sensor_adc_UABH_B__X2_FLAGS & 0x2 )==0)
        #define engine_sensor_adc_UABH_B_X2 (1)
        #define engine_sensor_adc_UABH_B__X3_FLAGS (engine_sensor_adc_UABH_B__X2_FLAGS|0x2)
    #elif (( engine_sensor_adc_UABH_B__X2_FLAGS & 0x4 )==0)
        #define engine_sensor_adc_UABH_B_X2 (2)
        #define engine_sensor_adc_UABH_B__X3_FLAGS (engine_sensor_adc_UABH_B__X2_FLAGS|0x4)
    #elif (( engine_sensor_adc_UABH_B__X2_FLAGS & 0x8 )==0)
        #define engine_sensor_adc_UABH_B_X2 (3)
        #define engine_sensor_adc_UABH_B__X3_FLAGS (engine_sensor_adc_UABH_B__X2_FLAGS|0x8)
    #else
        #error "engine_sensor_adc_UABH_B_X2 mapping is bad"
    #endif
#endif

/*x3 input assignment*/
#if ( (0<=engine_sensor_adc_UABH_B_halfuab__X3) && (engine_sensor_adc_UABH_B_halfuab__X3<=3) )
    /*fitter assignment is valid*/
    #define engine_sensor_adc_UABH_B_X3         (engine_sensor_adc_UABH_B_halfuab__X3)
    #define engine_sensor_adc_UABH_B__X4_FLAGS  (engine_sensor_adc_UABH_B__X3_FLAGS)
#else
    /*x2 input is unused (==-1), so map to unused vin*/
    #if   (( engine_sensor_adc_UABH_B__X3_FLAGS & 0x1 )==0)
        #define engine_sensor_adc_UABH_B_X3 (0)
        #define engine_sensor_adc_UABH_B__X4_FLAGS (engine_sensor_adc_UABH_B__X3_FLAGS|0x1)
    #elif (( engine_sensor_adc_UABH_B__X3_FLAGS & 0x2 )==0)
        #define engine_sensor_adc_UABH_B_X3 (1)
        #define engine_sensor_adc_UABH_B__X4_FLAGS (engine_sensor_adc_UABH_B__X3_FLAGS|0x2)
    #elif (( engine_sensor_adc_UABH_B__X3_FLAGS & 0x4 )==0)
        #define engine_sensor_adc_UABH_B_X3 (2)
        #define engine_sensor_adc_UABH_B__X4_FLAGS (engine_sensor_adc_UABH_B__X3_FLAGS|0x4)
    #elif (( engine_sensor_adc_UABH_B__X3_FLAGS & 0x8 )==0)
        #define engine_sensor_adc_UABH_B_X3 (3)
        #define engine_sensor_adc_UABH_B__X4_FLAGS (engine_sensor_adc_UABH_B__X3_FLAGS|0x8)
    #else
        #error "engine_sensor_adc_UABH_B_X3 mapping is bad"
    #endif
#endif

