uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/engine_sensor_adc_UABH_B_regs.h
#define engine_sensor_adc_UABH_B_SW_STATIC_ADDR               (engine_sensor_adc_UABH_B_halfuab__SW_STATIC )
#define engine_sensor_adc_UABH_B_SW_STATIC_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_STATIC_ADDR)
#define engine_sensor_adc_UABH_B_SW_STATIC_REG                (*(engine_sensor_adc_UABH_B_SW_STATIC_PTR))

#define engine_sensor_adc_UABH_B_SW_MODBIT_SRC_ADDR            (engine_sensor_adc_UABH_B_halfuab__SW_MODBIT_SRC)
#define engine_sensor_adc_UABH_B_SW_MODBIT_SRC_PTR            ((reg32*)engine_sensor_adc_UABH_B_SW_MODBIT_SRC_ADDR)
#define engine_sensor_adc_UABH_B_SW_MODBIT_SRC_REG            (*(engine_sensor_adc_UABH_B_SW_MODBIT_SRC_PTR))

#define engine_sensor_adc_UABH_B_SW_CA_IN0_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CA_IN0)
#define engine_sensor_adc_UABH_B_SW_CA_IN0_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CA_IN0_ADDR)
#define engine_sensor_adc_UABH_B_SW_CA_IN0_REG                (*(engine_sensor_adc_UABH_B_SW_CA_IN0_PTR))

#define engine_sensor_adc_UABH_B_SW_CA_IN1_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CA_IN1)
#define engine_sensor_adc_UABH_B_SW_CA_IN1_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CA_IN1_ADDR)
#define engine_sensor_adc_UABH_B_SW_CA_IN1_REG                (*(engine_sensor_adc_UABH_B_SW_CA_IN1_PTR))

#define engine_sensor_adc_UABH_B_SW_CA_TOP_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CA_TOP)
#define engine_sensor_adc_UABH_B_SW_CA_TOP_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CA_TOP_ADDR)
#define engine_sensor_adc_UABH_B_SW_CA_TOP_REG                (*(engine_sensor_adc_UABH_B_SW_CA_TOP_PTR))

#define engine_sensor_adc_UABH_B_SW_CB_IN0_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CB_IN0)
#define engine_sensor_adc_UABH_B_SW_CB_IN0_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CB_IN0_ADDR)
#define engine_sensor_adc_UABH_B_SW_CB_IN0_REG                (*(engine_sensor_adc_UABH_B_SW_CB_IN0_PTR))

#define engine_sensor_adc_UABH_B_SW_CB_IN1_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CB_IN1)
#define engine_sensor_adc_UABH_B_SW_CB_IN1_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CB_IN1_ADDR)
#define engine_sensor_adc_UABH_B_SW_CB_IN1_REG                (*(engine_sensor_adc_UABH_B_SW_CB_IN1_PTR))

#define engine_sensor_adc_UABH_B_SW_CB_TOP_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CB_TOP)
#define engine_sensor_adc_UABH_B_SW_CB_TOP_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CB_TOP_ADDR)
#define engine_sensor_adc_UABH_B_SW_CB_TOP_REG                (*(engine_sensor_adc_UABH_B_SW_CB_TOP_PTR))

#define engine_sensor_adc_UABH_B_SW_CC_IN0_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CC_IN0)
#define engine_sensor_adc_UABH_B_SW_CC_IN0_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CC_IN0_ADDR)
#define engine_sensor_adc_UABH_B_SW_CC_IN0_REG                (*(engine_sensor_adc_UABH_B_SW_CC_IN0_PTR))

#define engine_sensor_adc_UABH_B_SW_CC_IN1_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CC_IN1)
#define engine_sensor_adc_UABH_B_SW_CC_IN1_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CC_IN1_ADDR)
#define engine_sensor_adc_UABH_B_SW_CC_IN1_REG                (*(engine_sensor_adc_UABH_B_SW_CC_IN1_PTR))

#define engine_sensor_adc_UABH_B_SW_CC_TOP_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CC_TOP)
#define engine_sensor_adc_UABH_B_SW_CC_TOP_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CC_TOP_ADDR)
#define engine_sensor_adc_UABH_B_SW_CC_TOP_REG                (*(engine_sensor_adc_UABH_B_SW_CC_TOP_PTR))

#define engine_sensor_adc_UABH_B_SW_CF_BOT_ADDR                (engine_sensor_adc_UABH_B_halfuab__SW_CF_BOT)
#define engine_sensor_adc_UABH_B_SW_CF_BOT_PTR                ((reg32*)engine_sensor_adc_UABH_B_SW_CF_BOT_ADDR)
#define engine_sensor_adc_UABH_B_SW_CF_BOT_REG                (*(engine_sensor_adc_UABH_B_SW_CF_BOT_PTR))

#define engine_sensor_adc_UABH_B_SW_OTHER_ADDR                 (engine_sensor_adc_UABH_B_halfuab__SW_OTHER)
#define engine_sensor_adc_UABH_B_SW_OTHER_PTR                 ((reg32*)engine_sensor_adc_UABH_B_SW_OTHER_ADDR)
#define engine_sensor_adc_UABH_B_SW_OTHER_REG                 (*(engine_sensor_adc_UABH_B_SW_OTHER_PTR))

#define engine_sensor_adc_UABH_B_SW_BOOST_CTRL_ADDR            (engine_sensor_adc_UABH_B_halfuab__SW_BOOST_CTRL)
#define engine_sensor_adc_UABH_B_SW_BOOST_CTRL_PTR            ((reg32*)engine_sensor_adc_UABH_B_SW_BOOST_CTRL_ADDR)
#define engine_sensor_adc_UABH_B_SW_BOOST_CTRL_REG            (*(engine_sensor_adc_UABH_B_SW_BOOST_CTRL_PTR))

#define engine_sensor_adc_UABH_B_SRAM_CTRL_ADDR                (engine_sensor_adc_UABH_B_halfuab__SRAM_CTRL)
#define engine_sensor_adc_UABH_B_SRAM_CTRL_PTR                ((reg32*)engine_sensor_adc_UABH_B_SRAM_CTRL_ADDR)
#define engine_sensor_adc_UABH_B_SRAM_CTRL_REG                (*(engine_sensor_adc_UABH_B_SRAM_CTRL_PTR))

#define engine_sensor_adc_UABH_B_STAT_ADDR                     (engine_sensor_adc_UABH_B_halfuab__STAT)
#define engine_sensor_adc_UABH_B_STAT_PTR                     ((reg32*)engine_sensor_adc_UABH_B_STAT_ADDR)
#define engine_sensor_adc_UABH_B_STAT_REG                     (*(engine_sensor_adc_UABH_B_STAT_PTR))

#define engine_sensor_adc_UABH_B_SRAM0_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM0)
#define engine_sensor_adc_UABH_B_SRAM0_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM0_ADDR)
#define engine_sensor_adc_UABH_B_SRAM0_REG                    (*(engine_sensor_adc_UABH_B_SRAM0_PTR))

#define engine_sensor_adc_UABH_B_SRAM1_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM1)
#define engine_sensor_adc_UABH_B_SRAM1_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM1_ADDR)
#define engine_sensor_adc_UABH_B_SRAM1_REG                    (*(engine_sensor_adc_UABH_B_SRAM1_PTR))

#define engine_sensor_adc_UABH_B_SRAM2_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM2)
#define engine_sensor_adc_UABH_B_SRAM2_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM2_ADDR)
#define engine_sensor_adc_UABH_B_SRAM2_REG                    (*(engine_sensor_adc_UABH_B_SRAM2_PTR))

#define engine_sensor_adc_UABH_B_SRAM3_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM3)
#define engine_sensor_adc_UABH_B_SRAM3_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM3_ADDR)
#define engine_sensor_adc_UABH_B_SRAM3_REG                    (*(engine_sensor_adc_UABH_B_SRAM3_PTR))

#define engine_sensor_adc_UABH_B_SRAM4_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM4)
#define engine_sensor_adc_UABH_B_SRAM4_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM4_ADDR)
#define engine_sensor_adc_UABH_B_SRAM4_REG                    (*(engine_sensor_adc_UABH_B_SRAM4_PTR))

#define engine_sensor_adc_UABH_B_SRAM5_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM5)
#define engine_sensor_adc_UABH_B_SRAM5_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM5_ADDR)
#define engine_sensor_adc_UABH_B_SRAM5_REG                    (*(engine_sensor_adc_UABH_B_SRAM5_PTR))

