uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/engine_sensor_adc_UABH_B_regs.h
#define engine_sensor_adc_UABH_B_SRAM6_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM6)
#define engine_sensor_adc_UABH_B_SRAM6_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM6_ADDR)
#define engine_sensor_adc_UABH_B_SRAM6_REG                    (*(engine_sensor_adc_UABH_B_SRAM6_PTR))

#define engine_sensor_adc_UABH_B_SRAM7_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM7)
#define engine_sensor_adc_UABH_B_SRAM7_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM7_ADDR)
#define engine_sensor_adc_UABH_B_SRAM7_REG                    (*(engine_sensor_adc_UABH_B_SRAM7_PTR))

#define engine_sensor_adc_UABH_B_SRAM8_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM8)
#define engine_sensor_adc_UABH_B_SRAM8_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM8_ADDR)
#define engine_sensor_adc_UABH_B_SRAM8_REG                    (*(engine_sensor_adc_UABH_B_SRAM8_PTR))

#define engine_sensor_adc_UABH_B_SRAM9_ADDR                    (engine_sensor_adc_UABH_B_halfuab__SRAM9)
#define engine_sensor_adc_UABH_B_SRAM9_PTR                    ((reg32*)engine_sensor_adc_UABH_B_SRAM9_ADDR)
#define engine_sensor_adc_UABH_B_SRAM9_REG                    (*(engine_sensor_adc_UABH_B_SRAM9_PTR))

#define engine_sensor_adc_UABH_B_SRAM10_ADDR                   (engine_sensor_adc_UABH_B_halfuab__SRAM10)
#define engine_sensor_adc_UABH_B_SRAM10_PTR                   ((reg32*)engine_sensor_adc_UABH_B_SRAM10_ADDR)
#define engine_sensor_adc_UABH_B_SRAM10_REG                   (*(engine_sensor_adc_UABH_B_SRAM10_PTR))

#define engine_sensor_adc_UABH_B_SRAM11_ADDR                   (engine_sensor_adc_UABH_B_halfuab__SRAM11)
#define engine_sensor_adc_UABH_B_SRAM11_PTR                   ((reg32*)engine_sensor_adc_UABH_B_SRAM11_ADDR)
#define engine_sensor_adc_UABH_B_SRAM11_REG                   (*(engine_sensor_adc_UABH_B_SRAM11_PTR))

#define engine_sensor_adc_UABH_B_SRAM12_ADDR                   (engine_sensor_adc_UABH_B_halfuab__SRAM12)
#define engine_sensor_adc_UABH_B_SRAM12_PTR                   ((reg32*)engine_sensor_adc_UABH_B_SRAM12_ADDR)
#define engine_sensor_adc_UABH_B_SRAM12_REG                   (*(engine_sensor_adc_UABH_B_SRAM12_PTR))

#define engine_sensor_adc_UABH_B_SRAM13_ADDR                   (engine_sensor_adc_UABH_B_halfuab__SRAM13)
#define engine_sensor_adc_UABH_B_SRAM13_PTR                   ((reg32*)engine_sensor_adc_UABH_B_SRAM13_ADDR)
#define engine_sensor_adc_UABH_B_SRAM13_REG                   (*(engine_sensor_adc_UABH_B_SRAM13_PTR))

#define engine_sensor_adc_UABH_B_SRAM14_ADDR                   (engine_sensor_adc_UABH_B_halfuab__SRAM14)
#define engine_sensor_adc_UABH_B_SRAM14_PTR                   ((reg32*)engine_sensor_adc_UABH_B_SRAM14_ADDR)
#define engine_sensor_adc_UABH_B_SRAM14_REG                   (*(engine_sensor_adc_UABH_B_SRAM14_PTR))

#define engine_sensor_adc_UABH_B_SRAM15_ADDR                   (engine_sensor_adc_UABH_B_halfuab__SRAM15)
#define engine_sensor_adc_UABH_B_SRAM15_PTR                   ((reg32*)engine_sensor_adc_UABH_B_SRAM15_ADDR)
#define engine_sensor_adc_UABH_B_SRAM15_REG                   (*(engine_sensor_adc_UABH_B_SRAM15_PTR))

#define engine_sensor_adc_UABH_B_SW_CC1_IN0_ADDR               (engine_sensor_adc_UABH_B_halfuab__SW_CC1_IN0)
#define engine_sensor_adc_UABH_B_SW_CC1_IN0_PTR               ((reg32*)engine_sensor_adc_UABH_B_SW_CC1_IN0_ADDR)
#define engine_sensor_adc_UABH_B_SW_CC1_IN0_REG               (*(engine_sensor_adc_UABH_B_SW_CC1_IN0_PTR))

#define engine_sensor_adc_UABH_B_SW_CC1_IN1_ADDR               (engine_sensor_adc_UABH_B_halfuab__SW_CC1_IN1)
#define engine_sensor_adc_UABH_B_SW_CC1_IN1_PTR               ((reg32*)engine_sensor_adc_UABH_B_SW_CC1_IN1_ADDR)
#define engine_sensor_adc_UABH_B_SW_CC1_IN1_REG               (*(engine_sensor_adc_UABH_B_SW_CC1_IN1_PTR))

#define engine_sensor_adc_UABH_B_SW_CC1_TOP_ADDR               (engine_sensor_adc_UABH_B_halfuab__SW_CC1_TOP)
#define engine_sensor_adc_UABH_B_SW_CC1_TOP_PTR               ((reg32*)engine_sensor_adc_UABH_B_SW_CC1_TOP_ADDR)
#define engine_sensor_adc_UABH_B_SW_CC1_TOP_REG               (*(engine_sensor_adc_UABH_B_SW_CC1_TOP_PTR))

#define engine_sensor_adc_UABH_B_CAP_TRIM_ADDR                 (engine_sensor_adc_UABH_B_halfuab__CAP_TRIM)
#define engine_sensor_adc_UABH_B_CAP_TRIM_PTR                 ((reg32*)engine_sensor_adc_UABH_B_CAP_TRIM_ADDR)
#define engine_sensor_adc_UABH_B_CAP_TRIM_REG                 (*(engine_sensor_adc_UABH_B_CAP_TRIM_PTR))

#define engine_sensor_adc_UABH_B_OA_TRIM_ADDR                  (engine_sensor_adc_UABH_B_halfuab__OA_TRIM)
#define engine_sensor_adc_UABH_B_OA_TRIM_PTR                  ((reg32*)engine_sensor_adc_UABH_B_OA_TRIM_ADDR)
#define engine_sensor_adc_UABH_B_OA_TRIM_REG                  (*(engine_sensor_adc_UABH_B_OA_TRIM_PTR))

/* Starting address for half UAB region */
#define engine_sensor_adc_UABH_B_BASE_ADDR                    (engine_sensor_adc_UABH_B_halfuab__OA_CTRL)
    



/*Register Field Definitions*/

    
/*UAB_CTRL*/
#define engine_sensor_adc_UABH_B_ENABLED_SHIFT                CyUAB_ENABLED_SHIFT
#define engine_sensor_adc_UABH_B_ENABLED_MASK                 (1UL<<engine_sensor_adc_UABH_B_ENABLED_SHIFT)


/*INTR*/
#if engine_sensor_adc_UABH_B_ISODD==1
    #define engine_sensor_adc_UABH_B_INTR_COMP_SHIFT CyUAB_INTR_COMP1_SHIFT
#else
    #define engine_sensor_adc_UABH_B_INTR_COMP_SHIFT CyUAB_INTR_COMP0_SHIFT
#endif
#define engine_sensor_adc_UABH_B_INTR_COMP_MASK               (1UL<<engine_sensor_adc_UABH_B_INTR_COMP_SHIFT)

#if engine_sensor_adc_UABH_B_ISODD==1
   #define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC1_EMPTY_SHIFT
#else
   #define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC0_EMPTY_SHIFT
#endif
#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASK         (1UL<<engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SHIFT)


/*INTR_SET*/
#define engine_sensor_adc_UABH_B_INTR_COMP_SET_SHIFT          engine_sensor_adc_UABH_B_INTR_COMP_SHIFT
#define engine_sensor_adc_UABH_B_INTR_COMP_SET_MASK           (1UL<<engine_sensor_adc_UABH_B_INTR_COMP_SET_SHIFT)

#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SET_SHIFT    engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SET_MASK     (1UL<<engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SET_SHIFT)


/*INTR_MASK*/
#define engine_sensor_adc_UABH_B_INTR_COMP_MASK_SHIFT         engine_sensor_adc_UABH_B_INTR_COMP_SHIFT
#define engine_sensor_adc_UABH_B_INTR_COMP_MASK_MASK          (1UL<<engine_sensor_adc_UABH_B_INTR_COMP_MASK_SHIFT)

#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASK_SHIFT   engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASK_MASK    (1UL<<engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASK_SHIFT)


