uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/engine_sensor_adc_UABH_B_regs.h
/*INTR_MASKED*/
#define engine_sensor_adc_UABH_B_INTR_COMP_MASKED_SHIFT       engine_sensor_adc_UABH_B_INTR_COMP_SHIFT
#define engine_sensor_adc_UABH_B_INTR_COMP_MASKED_MASK        (1UL<<engine_sensor_adc_UABH_B_INTR_COMP_MASKED_SHIFT)

#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASKED_SHIFT engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASKED_MASK  (1UL<<engine_sensor_adc_UABH_B_INTR_VDAC_EMPTY_MASKED_SHIFT)


/*OA_CTRL*/
#define engine_sensor_adc_UABH_B_OA_PWR_SHIFT                 CyUAB_OA_PWR_SHIFT
#define engine_sensor_adc_UABH_B_OA_PWR_MASK                  (0x7UL<<engine_sensor_adc_UABH_B_OA_PWR_SHIFT)

#define engine_sensor_adc_UABH_B_CMP_PWR_SHIFT                CyUAB_CMP_PWR_SHIFT
#define engine_sensor_adc_UABH_B_CMP_PWR_MASK                 (0x7UL<<engine_sensor_adc_UABH_B_CMP_PWR_SHIFT)

#define engine_sensor_adc_UABH_B_CMP_EDGE_SHIFT               CyUAB_CMP_EDGE_SHIFT
#define engine_sensor_adc_UABH_B_CMP_EDGE_MASK                (0x3UL<<engine_sensor_adc_UABH_B_CMP_EDGE_SHIFT)
#define engine_sensor_adc_UABH_B_CMP_EDGE_DISABLE             (0UL)
#define engine_sensor_adc_UABH_B_CMP_EDGE_RISING              (1UL)
#define engine_sensor_adc_UABH_B_CMP_EDGE_FALLING             (2UL)
#define engine_sensor_adc_UABH_B_CMP_EDGE_BOTH                (3UL)

#define engine_sensor_adc_UABH_B_CMP_DSI_LEVEL_SHIFT          CyUAB_CMP_DSI_LEVEL_SHIFT
#define engine_sensor_adc_UABH_B_CMP_DSI_LEVEL_MASK           (1UL<<engine_sensor_adc_UABH_B_CMP_DSI_LEVEL_SHIFT)

#define engine_sensor_adc_UABH_B_CTRL_SPARE_SHIFT             CyUAB_CTRL_SPARE_SHIFT
#define engine_sensor_adc_UABH_B_CTRL_SPARE_MASK              (1UL<<engine_sensor_adc_UABH_B_CTRL_SPARE_SHIFT)

#define engine_sensor_adc_UABH_B_REF_PWR_SHIFT                CyUAB_REF_PWR_SHIFT
#define engine_sensor_adc_UABH_B_REF_PWR_MASK                 (0x7UL<<engine_sensor_adc_UABH_B_REF_PWR_SHIFT)

#define engine_sensor_adc_UABH_B_REF_PTS_SHIFT                CyUAB_REF_PTS_SHIFT
#define engine_sensor_adc_UABH_B_REF_PTS_MASK                 (1UL<<engine_sensor_adc_UABH_B_REF_PTS_SHIFT)

#define engine_sensor_adc_UABH_B_AGND_PWR_SHIFT               CyUAB_AGND_PWR_SHIFT
#define engine_sensor_adc_UABH_B_AGND_PWR_MASK                (0x7UL<<engine_sensor_adc_UABH_B_AGND_PWR_SHIFT)

#define engine_sensor_adc_UABH_B_AGND_PTS_SHIFT               CyUAB_AGND_PTS_SHIFT
#define engine_sensor_adc_UABH_B_AGND_PTS_MASK                (1UL<<engine_sensor_adc_UABH_B_AGND_PTS_SHIFT)

#define engine_sensor_adc_UABH_B_AGND_TIED_SHIFT              CyUAB_AGND_TIED_SHIFT
#define engine_sensor_adc_UABH_B_AGND_TIED_MASK               (1UL<<engine_sensor_adc_UABH_B_AGND_TIED_SHIFT)

#define engine_sensor_adc_UABH_B_REF_TIED_SHIFT               CyUAB_REF_TIED_SHIFT
#define engine_sensor_adc_UABH_B_REF_TIED_MASK                (1UL<<engine_sensor_adc_UABH_B_REF_TIED_SHIFT)    
    
#define engine_sensor_adc_UABH_B_UAB_PWR_SHIFT                CyUAB_UAB_PWR_SHIFT
#define engine_sensor_adc_UABH_B_UAB_PWR_MASK                 (0x3UL<<engine_sensor_adc_UABH_B_UAB_PWR_SHIFT)
#define engine_sensor_adc_UABH_B_UAB_PWR_NORMAL               (0UL)
#define engine_sensor_adc_UABH_B_UAB_PWR_ULTRA_LOW            (1UL)
#define engine_sensor_adc_UABH_B_UAB_PWR_ULTRA_HIGH           (2UL)
#define engine_sensor_adc_UABH_B_UAB_PWR_Reserved             (3UL)


/*CAP_CTRL*/
#define engine_sensor_adc_UABH_B_CB_GND_SHIFT                 CyUAB_CB_GND_SHIFT
#define engine_sensor_adc_UABH_B_CB_GND_MASK                  (1UL<<engine_sensor_adc_UABH_B_CB_GND_SHIFT)

#define engine_sensor_adc_UABH_B_CC_GND_SHIFT                 CyUAB_CC_GND_SHIFT
#define engine_sensor_adc_UABH_B_CC_GND_MASK                  (1UL<<engine_sensor_adc_UABH_B_CC_GND_SHIFT)

#define engine_sensor_adc_UABH_B_FRC_SIGN_BIT_SHIFT           CyUAB_FRC_SIGN_BIT_SHIFT
#define engine_sensor_adc_UABH_B_FRC_SIGN_BIT_MASK            (1UL<<CyUAB_FRC_SIGN_BIT_SHIFT)

#define engine_sensor_adc_UABH_B_DAC_MODE_EN_SHIFT            CyUAB_DAC_MODE_EN_SHIFT
#define engine_sensor_adc_UABH_B_DAC_MODE_EN_MASK             (1UL<<engine_sensor_adc_UABH_B_DAC_MODE_EN_SHIFT)

#define engine_sensor_adc_UABH_B_DAC_MODE_SHIFT               CyUAB_DAC_MODE_SHIFT
#define engine_sensor_adc_UABH_B_DAC_MODE_MASK                (0x3UL<<engine_sensor_adc_UABH_B_DAC_MODE_SHIFT)
#define engine_sensor_adc_UABH_B_DAC_MODE_UNSIGNED12          (0UL)
#define engine_sensor_adc_UABH_B_DAC_MODE_VIRT_SIGNED12       (1UL)
#define engine_sensor_adc_UABH_B_DAC_MODE_SIGNED13            (2UL)
#define engine_sensor_adc_UABH_B_DAC_MODE_RESERVED            (3UL)


/*CAP_ABCF_VAL, CAP_AB_VAL_NXT, and CAP_CF_VAL_NXT*/
#define engine_sensor_adc_UABH_B_CB_VAL_SHIFT                 CyUAB_CB_VAL_SHIFT
#define engine_sensor_adc_UABH_B_CB_VAL_MASK                  (0x3fUL<<engine_sensor_adc_UABH_B_CB_VAL_SHIFT)

#define engine_sensor_adc_UABH_B_CA_VAL_SHIFT                 CyUAB_CA_VAL_SHIFT
#define engine_sensor_adc_UABH_B_CA_VAL_MASK                  (0x3fUL<<engine_sensor_adc_UABH_B_CA_VAL_SHIFT)

#define engine_sensor_adc_UABH_B_SIGN_VAL_SHIFT               CyUAB_SIGN_VAL_SHIFT
#define engine_sensor_adc_UABH_B_SIGN_VAL_MASK                (1UL<<engine_sensor_adc_UABH_B_SIGN_VAL_SHIFT)

#define engine_sensor_adc_UABH_B_CB_64_SHIFT                  CyUAB_CB_64_SHIFT
#define engine_sensor_adc_UABH_B_CB_64_MASK                   (1UL<<engine_sensor_adc_UABH_B_CB_64_SHIFT)

#define engine_sensor_adc_UABH_B_CC_VAL_SHIFT                 CyUAB_CC_VAL_SHIFT
#define engine_sensor_adc_UABH_B_CC_VAL_MASK                  (0x3fUL<<engine_sensor_adc_UABH_B_CC_VAL_SHIFT)

#define engine_sensor_adc_UABH_B_CF_VAL_SHIFT                 CyUAB_CF_VAL_SHIFT
#define engine_sensor_adc_UABH_B_CF_VAL_MASK                  (0x1fUL<<engine_sensor_adc_UABH_B_CF_VAL_SHIFT)


/*CAP_CF_VAL_NXT*/
#define engine_sensor_adc_UABH_B_CC_VAL_UPDATE_SHIFT          CyUAB_CC_VAL_UPDATE_SHIFT
#define engine_sensor_adc_UABH_B_CC_VAL_UPDATE_MASK           (1UL<<engine_sensor_adc_UABH_B_CC_VAL_UPDATE_SHIFT)

#define engine_sensor_adc_UABH_B_CF_VAL_UPDATE_SHIFT          CyUAB_CF_VAL_UPDATE_SHIFT
#define engine_sensor_adc_UABH_B_CF_VAL_UPDATE_MASK           (1UL<<engine_sensor_adc_UABH_B_CF_VAL_UPDATE_SHIFT)


/*STARTUP_DELAY*/
#define engine_sensor_adc_UABH_B_STARTUP_DELAY_SHIFT          CyUAB_STARTUP_DELAY_SHIFT
#define engine_sensor_adc_UABH_B_STARTUP_DELAY_MASK           (0x0000ffffUL)

