uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/engine_sensor_adc_UABH_B_regs.h
#define engine_sensor_adc_UABH_B_ALIGN_MODE_SHIFT             CyUAB_ALIGN_MODE_SHIFT
#define engine_sensor_adc_UABH_B_ALIGN_MODE_MASK              (1UL<<engine_sensor_adc_UABH_B_ALIGN_MODE_SHIFT)


/*SUBSAMPLE_CTRL*/
#define engine_sensor_adc_UABH_B_SUBSAMPLE_SHIFT              CyUAB_SUBSAMPLE_SHIFT
#define engine_sensor_adc_UABH_B_SUBSAMPLE_MASK               (0xffUL<<engine_sensor_adc_UABH_B_SUBSAMPLE_SHIFT)

#define engine_sensor_adc_UABH_B_SUBSAMPLE_INIT_SHIFT         CyUAB_SUBSAMPLE_INIT_SHIFT
#define engine_sensor_adc_UABH_B_SUBSAMPLE_INIT_MASK          (0xffUL<<engine_sensor_adc_UABH_B_SUBSAMPLE_INIT_SHIFT)


/*SW_STATIC*/
#define engine_sensor_adc_UABH_B_SW_G0_SHIFT                  CyUAB_SW_G0_SHIFT
#define engine_sensor_adc_UABH_B_SW_G0_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_G0_SHIFT)

#define engine_sensor_adc_UABH_B_SW_G1_SHIFT                  CyUAB_SW_G1_SHIFT
#define engine_sensor_adc_UABH_B_SW_G1_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_G1_SHIFT)

#define engine_sensor_adc_UABH_B_SW_G2_SHIFT                  CyUAB_SW_G2_SHIFT
#define engine_sensor_adc_UABH_B_SW_G2_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_G2_SHIFT)

#define engine_sensor_adc_UABH_B_SW_G3_SHIFT                  CyUAB_SW_G3_SHIFT
#define engine_sensor_adc_UABH_B_SW_G3_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_G3_SHIFT)

#define engine_sensor_adc_UABH_B_SW_RG_SHIFT                  CyUAB_SW_RG_SHIFT
#define engine_sensor_adc_UABH_B_SW_RG_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_RG_SHIFT)

#define engine_sensor_adc_UABH_B_SW_GG_SHIFT                  CyUAB_SW_GG_SHIFT
#define engine_sensor_adc_UABH_B_SW_GG_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_GG_SHIFT)

#define engine_sensor_adc_UABH_B_SW_RT_SHIFT                  CyUAB_SW_RT_SHIFT
#define engine_sensor_adc_UABH_B_SW_RT_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_RT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_GT_SHIFT                  CyUAB_SW_GT_SHIFT
#define engine_sensor_adc_UABH_B_SW_GT_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_GT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_QT_SHIFT                  CyUAB_SW_QT_SHIFT
#define engine_sensor_adc_UABH_B_SW_QT_MASK                   (1UL<<engine_sensor_adc_UABH_B_SW_QT_SHIFT)

#define engine_sensor_adc_UABH_B_EARLY_PS_SHIFT               CyUAB_EARLY_PS_SHIFT
#define engine_sensor_adc_UABH_B_EARLY_PS_MASK                (1UL<<engine_sensor_adc_UABH_B_EARLY_PS_SHIFT)

#define engine_sensor_adc_UABH_B_EARLY_PO_SHIFT               CyUAB_EARLY_PO_SHIFT
#define engine_sensor_adc_UABH_B_EARLY_PO_MASK                (1UL<<engine_sensor_adc_UABH_B_EARLY_PO_SHIFT)

#define engine_sensor_adc_UABH_B_STRB_RST_SEL_SHIFT           CyUAB_STRB_RST_SEL_SHIFT
#define engine_sensor_adc_UABH_B_STRB_RST_SEL_MASK            (0x1fUL<<engine_sensor_adc_UABH_B_STRB_RST_SEL_SHIFT)

#define engine_sensor_adc_UABH_B_STRB_RST_EN_SHIFT            CyUAB_STRB_RST_EN_SHIFT
#define engine_sensor_adc_UABH_B_STRB_RST_EN_MASK             (1UL<<engine_sensor_adc_UABH_B_STRB_RST_EN_SHIFT)


/*SW_MODBIT_SRC*/
#define engine_sensor_adc_UABH_B_MODBIT0_SRC_SEL_SHIFT        CyUAB_MODBIT0_SRC_SEL_SHIFT
#define engine_sensor_adc_UABH_B_MODBIT0_SRC_SEL_MASK         (0x1fUL<<engine_sensor_adc_UABH_B_MODBIT0_SRC_SEL_SHIFT)

#define engine_sensor_adc_UABH_B_MODBIT1_SRC_SEL_SHIFT        CyUAB_MODBIT1_SRC_SEL_SHIFT
#define engine_sensor_adc_UABH_B_MODBIT1_SRC_SEL_MASK         (0x1fUL<<engine_sensor_adc_UABH_B_MODBIT1_SRC_SEL_SHIFT)


/*SW_CA_IN0*/
#define engine_sensor_adc_UABH_B_SW_A0_MODBIT_SHIFT           CyUAB_SW_A0_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_A0_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_A0_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_A1_MODBIT_SHIFT           CyUAB_SW_A1_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_A1_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_A1_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_A2_MODBIT_SHIFT           CyUAB_SW_A2_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_A2_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_A2_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_A3_MODBIT_SHIFT           CyUAB_SW_A3_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_A3_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_A3_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_AP_SHIFT                  CyUAB_SW_AP_SHIFT
#define engine_sensor_adc_UABH_B_SW_AP_MASK                   (0xfUL<<engine_sensor_adc_UABH_B_SW_AP_SHIFT)

#define engine_sensor_adc_UABH_B_SW_AQ_SHIFT                  CyUAB_SW_AQ_SHIFT
#define engine_sensor_adc_UABH_B_SW_AQ_MASK                   (0xfUL<<engine_sensor_adc_UABH_B_SW_AQ_SHIFT)

/*SW_CA_IN1*/    
#define engine_sensor_adc_UABH_B_SW_AA_SHIFT                  CyUAB_SW_AA_SHIFT
#define engine_sensor_adc_UABH_B_SW_AA_MASK                   (0xfUL<<engine_sensor_adc_UABH_B_SW_AA_SHIFT)

#define engine_sensor_adc_UABH_B_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_AR_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_AR_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_AG_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_AG_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_AV_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_AV_MODBIT_SHIFT)


/*SW_CA_TOP*/
#define engine_sensor_adc_UABH_B_SW_RA_MODBIT_SHIFT           CyUAB_SW_RA_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_RA_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_RA_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_GA_MODBIT_SHIFT           CyUAB_SW_GA_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_GA_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_GA_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_VA_MODBIT_SHIFT           CyUAB_SW_VA_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_VA_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_VA_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_B_SW_SA_SHIFT                  CyUAB_SW_SA_SHIFT
#define engine_sensor_adc_UABH_B_SW_SA_MASK                   (0xfUL<<engine_sensor_adc_UABH_B_SW_SA_SHIFT)


/*SW_CB_IN0*/
#define engine_sensor_adc_UABH_B_SW_B0_MODBIT_SHIFT           CyUAB_SW_B0_MODBIT_SHIFT
#define engine_sensor_adc_UABH_B_SW_B0_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_B_SW_B0_MODBIT_SHIFT)

